Cerberus-Robotica/Robot_STM32F4/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2025 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f4xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

void HAL_TIM_MspPostInit(TIM_HandleTypeDef *htim);

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define LED_AZUL_Pin GPIO_PIN_13
#define LED_AZUL_GPIO_Port GPIOC
#define SENTIDO0_MOTOR3_Pin GPIO_PIN_0
#define SENTIDO0_MOTOR3_GPIO_Port GPIOB
#define SENTIDO1_MOTOR3_Pin GPIO_PIN_1
#define SENTIDO1_MOTOR3_GPIO_Port GPIOB
#define SENTIDO1_MOTOR2_Pin GPIO_PIN_2
#define SENTIDO1_MOTOR2_GPIO_Port GPIOB
#define SENTIDO0_MOTOR2_Pin GPIO_PIN_10
#define SENTIDO0_MOTOR2_GPIO_Port GPIOB
#define PWM_MOTOR1_Pin GPIO_PIN_8
#define PWM_MOTOR1_GPIO_Port GPIOA
#define SENTIDO0_MOTOR1_Pin GPIO_PIN_9
#define SENTIDO0_MOTOR1_GPIO_Port GPIOA
#define SENTIDO1_MOTOR1_Pin GPIO_PIN_10
#define SENTIDO1_MOTOR1_GPIO_Port GPIOA
#define SENTIDO1_MOTOR4_Pin GPIO_PIN_11
#define SENTIDO1_MOTOR4_GPIO_Port GPIOA
#define SENTIDO0_MOTOR4_Pin GPIO_PIN_12
#define SENTIDO0_MOTOR4_GPIO_Port GPIOA
#define PWM_MOTOR4_Pin GPIO_PIN_15
#define PWM_MOTOR4_GPIO_Port GPIOA
#define PWM_MOTOR3_Pin GPIO_PIN_4
#define PWM_MOTOR3_GPIO_Port GPIOB
#define PWM_MOTOR2_Pin GPIO_PIN_5
#define PWM_MOTOR2_GPIO_Port GPIOB
#define CE_Pin GPIO_PIN_6
#define CE_GPIO_Port GPIOB
#define CSN_Pin GPIO_PIN_7
#define CSN_GPIO_Port GPIOB

/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
